# Pandas 
## pandas as an open source , BSD- licenced library providing high performance, easy to use data structure  and data analysis tools for the python programming language.

## Agenda
- What is data frames?
- what is dat series?
- Different operation in pandas

In [1]:
import pandas as pd
import numpy as np

## DataFrame
- it is a combination of columns and rows, it shows basicaly representation of how your data is looks like when it will be loaded

In [2]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'], columns=["column1","column2","column3","column4"])

In [3]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [4]:
df.to_csv('Test1.csv')  ## to store in excel file we usw to_csv function

In [5]:
## Accesing the element 
## 1.  .loc  ---> focus on rows
## 2.   .iloc --> both rows and columns

df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [6]:
type(df.loc["Row1"]) #Series --> for only one row

pandas.core.series.Series

In [7]:
df.loc["Row4"]

column1    12
column2    13
column3    14
column4    15
Name: Row4, dtype: int32

In [8]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
df.iloc[0:3,0:2]

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9

In [10]:
type(df.iloc[0:3,0:2]) #DataFrame ---> for morethan 1 row and column

pandas.core.frame.DataFrame

In [11]:
df.iloc[0:3,0:1]

      column1
Row1        0
Row2        4
Row3        8

In [12]:
type(df.iloc[0:3,0:1]) # DataFrame

pandas.core.frame.DataFrame

In [13]:
df.iloc[0:3,0]

Row1    0
Row2    4
Row3    8
Name: column1, dtype: int32

In [14]:
type(df.iloc[0:3,0])  #Series

pandas.core.series.Series

In [15]:
#convert DataFrame into array

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [16]:
df.iloc[:,1:].values.shape

(5, 3)

In [17]:
df['column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: column1, dtype: int64

In [18]:
df.isnull()

      column1  column2  column3  column4
Row1    False    False    False    False
Row2    False    False    False    False
Row3    False    False    False    False
Row4    False    False    False    False
Row5    False    False    False    False

In [19]:
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [20]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [21]:
df['column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: column3, dtype: int32

In [22]:
df[['column3','column4']]  ## for multiple columns use list

      column3  column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [23]:
df = pd.read_csv('Ecommerce_Consumer_Behavior_Analysis_Data.csv')

In [24]:
df.head()

,Customer_ID,Age,Gender,Income_Level,Marital_Status,Education_Level,Occupation,Location,Purchase_Category,Purchase_Amount,...,Customer_Satisfaction,Engagement_with_Ads,Device_Used_for_Shopping,Payment_Method,Time_of_Purchase,Discount_Used,Customer_Loyalty_Program_Member,Purchase_Intent,Shipping_Preference,Time_to_Decision
0,37-611-6911,22,Female,Middle,Married,Bachelor's,Middle,Évry,Gardening & Outdoors,$333.80,...,7,None,Tablet,Credit Card,3/1/2024,True,False,Need-based,No Preference,2
1,29-392-9296,49,Male,High,Married,High School,High,Huocheng,Food & Beverages,$222.22,...,5,High,Tablet,PayPal,4/16/2024,True,False,Wants-based,Standard,6
2,84-649-5117,24,Female,Middle,Single,Master's,High,Huzhen,Office Supplies,$426.22,...,7,Low,Smartphone,Debit Card,3/15/2024,True,True,Impulsive,No Preference,3
3,48-980-6078,29,Female,Middle,Single,Master's,Middle,Wiwilí,Home Appliances,$101.31,...,1,None,Smartphone,Other,10/4/2024,True,True,Need-based,Express,10
4,91-170-9072,33,Female,Middle,Widowed,High School,Middle,Nara,Furniture,$211.70,...,10,None,Smartphone,Debit Card,1/30/2024,False,False,Wants-based,No Preference,4

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 28 columns):
 #   Column                                 Non-Null Count  Dtype
---  ------                                 --------------  -----
 0   Customer_ID                            1000 non-null   object
 1   Age                                    1000 non-null   int64
 2   Gender                                 1000 non-null   object
 3   Income_Level                           1000 non-null   object
 4   Marital_Status                         1000 non-null   object
 5   Education_Level                        1000 non-null   object
 6   Occupation                             1000 non-null   object
 7   Location                               1000 non-null   object
 8   Purchase_Category                      1000 non-null   object
 9   Purchase_Amount                        1000 non-null   object
 10  Frequency_of_Purchase                  1000 non-null   int64
 11  Purchase_Channel                       1000 non-null   object
 12  Brand_Loyalty                          1000 non-null   int64
 13  Product_Rating                         1000 non-null   int64
 14  Time_Spent_on_Product_Research(hours)  1000 non-null   float64
 15  Social_Media_Influence                 1000 non-null   object
 16  Discount_Sensitivity                   1000 non-null   object
 17  Return_Rate                            1000 non-null   int64
 18  Customer_Satisfaction                  1000 non-null   int64
 19  Engagement_with_Ads                    1000 non-null   object
 20  Device_Used_for_Shopping               1000 non-null   object
 21  Payment_Method                         1000 non-null   object
 22  Time_of_Purchase                       1000 non-null   object
 23  Discount_Used                          1000 non-null   bool
 24  Customer_Loyalty_Program_Member        1000 non-null   bool
 25  Purchase_Intent                        1000 non-null   object
 26  Shipping_Preference                    1000 non-null   object
 27  Time_to_Decision                       1000 non-null   int64
dtypes: bool(2), float64(1), int64(7), object(18)
memory usage: 205.2+ KB

In [26]:
df.describe()

,Age,Frequency_of_Purchase,Brand_Loyalty,Product_Rating,Time_Spent_on_Product_Research(hours),Return_Rate,Customer_Satisfaction,Time_to_Decision
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,34.304000,6.945000,3.026000,3.033000,1.013030,0.954000,5.399000,7.547000
std,9.353238,3.147361,1.416803,1.436654,0.791802,0.810272,2.868454,4.035849
min,18.000000,2.000000,1.000000,1.000000,0.000000,0.000000,1.000000,1.000000
25%,26.000000,4.000000,2.000000,2.000000,0.000000,0.000000,3.000000,4.000000
50%,34.500000,7.000000,3.000000,3.000000,1.000000,1.000000,5.000000,8.000000
75%,42.000000,10.000000,4.000000,4.000000,2.000000,2.000000,8.000000,11.000000
max,50.000000,12.000000,5.000000,5.000000,2.000000,2.000000,10.000000,14.000000

In [27]:
df['Age'].value_counts()

27    43
40    38
37    38
29    37
49    35
21    35
42    34
26    34
50    34
45    33
38    33
23    33
24    32
25    32
19    32
36    31
32    30
35    30
34    30
41    30
44    29
47    27
31    27
43    27
46    27
48    27
30    27
39    27
33    26
28    24
18    20
20    19
22    19
Name: Age, dtype: int64

In [28]:
df.corr()

,Age,Frequency_of_Purchase,Brand_Loyalty,Product_Rating,Time_Spent_on_Product_Research(hours),Return_Rate,Customer_Satisfaction,Discount_Used,Customer_Loyalty_Program_Member,Time_to_Decision
Age,1.000000,-0.045710,-0.012910,0.010427,0.000500,0.030773,-0.004152,0.006556,-0.010755,0.004209
Frequency_of_Purchase,-0.045710,1.000000,0.014463,-0.063577,0.009575,-0.017086,0.014075,0.036688,-0.016530,0.034838
Brand_Loyalty,-0.012910,0.014463,1.000000,-0.001406,-0.008146,0.014122,-0.034575,-0.057315,0.014456,-0.013869
Product_Rating,0.010427,-0.063577,-0.001406,1.000000,-0.036659,0.054620,-0.042549,-0.081124,-0.003069,-0.008123
Time_Spent_on_Product_Research(hours),0.000500,0.009575,-0.008146,-0.036659,1.000000,0.015679,0.008176,0.002305,-0.006819,-0.008795
Return_Rate,0.030773,-0.017086,0.014122,0.054620,0.015679,1.000000,0.022548,-0.019858,0.008857,0.036782
Customer_Satisfaction,-0.004152,0.014075,-0.034575,-0.042549,0.008176,0.022548,1.000000,0.010558,0.030762,-0.014635
Discount_Used,0.006556,0.036688,-0.057315,-0.081124,0.002305,-0.019858,0.010558,1.000000,0.048807,-0.006941
Customer_Loyalty_Program_Member,-0.010755,-0.016530,0.014456,-0.003069,-0.006819,0.008857,0.030762,0.048807,1.000000,-0.043428
Time_to_Decision,0.004209,0.034838,-0.013869,-0.008123,-0.008795,0.036782,-0.014635,-0.006941,-0.043428,1.000000

# csv

In [29]:
from io import StringIO,BytesIO

In [30]:
data = ('col1,col2,col3\n'
       'x,y,1\n'
       'a,b,2\n'
        'c,d,3')

In [31]:
type(data)

str

In [32]:
StringIO()  #Text I/O implementation using an in-memory buffer

In [33]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [34]:
df = pd.read_csv(StringIO(data),usecols = lambda x:x.upper() in['COL1','COL3'])

In [35]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [36]:
df.to_csv('Test2.csv')  ## to save file in csv

In [37]:
## Specifying columns data types

data = (
       'a,b,c,d\n'
       '1,2,3,4\n'
       '5,6,7,8\n'
       '9,10')

In [38]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10

In [39]:
df = pd.read_csv(StringIO(data),dtype = object)

In [40]:
df

   a   b    c    d
0  1   2    3    4
1  5   6    7    8
2  9  10  NaN  NaN

In [41]:
df['a'][1]

'5'

In [42]:
df['a']

0    1
1    5
2    9
Name: a, dtype: object

In [43]:
data = ('col1,col2,col3\n'
       '7,8,1\n'
       '4,5,2\n'
        '1,2,3')

In [44]:
df = pd.read_csv(StringIO(data),dtype = float)  ##for float and int it must not be none

In [45]:
df

   col1  col2  col3
0   7.0   8.0   1.0
1   4.0   5.0   2.0
2   1.0   2.0   3.0

In [46]:
df = pd.read_csv(StringIO(data),dtype = {'col1':int,'col2':float,'col3':object})
## can take different data type foe different columns

In [47]:
df

   col1  col2 col3
0     7   8.0    1
1     4   5.0    2
2     1   2.0    3

In [48]:
df.dtypes

col1      int32
col2    float64
col3     object
dtype: object

In [49]:
data = ('col1,col2,col3\n'
       '7,8,1\n'
       '4,5,2\n'
        '1,2,3')

In [50]:
## to make 1st column as index

df = pd.read_csv(StringIO(data),index_col = 2) # change according

In [51]:
df

      col1  col2
col3
1        7     8
2        4     5
3        1     2

In [52]:
data = (
       'a,b,c,d\n'
       '1,apple,3,4\n'
       '5,orange,7,8\n'
       '9,banana,10')

In [53]:
pd.read_csv(StringIO(data),index_col = 0) ## it does not show rows names

        b   c    d
a
1   apple   3  4.0
5  orange   7  8.0
9  banana  10  NaN

In [54]:
pd.read_csv(StringIO(data))

   a       b   c    d
0  1   apple   3  4.0
1  5  orange   7  8.0
2  9  banana  10  NaN

In [56]:
pd.read_csv(StringIO(data),index_col = False) ## it creats as it is original

   a       b   c    d
0  1   apple   3  4.0
1  5  orange   7  8.0
2  9  banana  10  NaN

In [57]:
## Quoting and Escape characters. Very usefull in NLP
data = 'a,b\n"hello,\\"Bob\\",nice to see you",5'

In [59]:
pd.read_csv(StringIO(data),escapechar='\\')

                             a  b
0  hello,"Bob",nice to see you  5